app/controllers/carts_controller.rb

SELECT * FROM "carts"
---
  def index
    @carts = Cart.all

SELECT * FROM "carts" WHERE ("carts"."id" = 2)
---
  def show
    @cart = Cart.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES('2021-08-06 08:51:00', '2021-08-06 08:51:00')
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT * FROM "carts" WHERE ("carts"."id" = 2)
DELETE FROM "carts" WHERE "id" = 2
---
  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy if @cart.id == session[:cart_id]