app/controllers/instruments_controller.rb

SELECT * FROM "instruments"
---
  def index
    @instruments = Instrument.all

SELECT * FROM "instruments" WHERE ("instruments"."id" = 1)
---
  def show
    @instrument = Instrument.find(params[:id])

SELECT * FROM "instruments" WHERE ("instruments"."id" = 1)
---
  def edit
    @instrument = Instrument.find(params[:id])

INSERT INTO "instruments" ("model", "user_id", "image", "brand", "finish", "condition", "created_at", "description", "price", "updated_at", "title") VALUES('PRS Custom 24', 1, 'instrument1.jpg', 'PRS', 'Red', 'Excellent', '2021-08-05 07:31:23', 'sssssssssss', 111.0, '2021-08-05 07:31:23', 'PRS Guitar')
---
  def create
    @instrument = current_user.instruments.build(params[:instrument])

    respond_to do |format|
      if @instrument.save

SELECT * FROM "instruments" WHERE ("instruments"."id" = 1)
---
  def update
    @instrument = Instrument.find(params[:id])