app/controllers/line_items_controller.rb

SELECT * FROM "line_items"
---
  def index
    @line_items = LineItem.all

SELECT * FROM "line_items" WHERE ("line_items"."id" = 1)
---
  def show
    @line_item = LineItem.find(params[:id])

SELECT * FROM "line_items" WHERE ("line_items"."id" = 1)
---
  def edit
    @line_item = LineItem.find(params[:id])

SELECT * FROM "instruments" WHERE ("instruments"."id" = 1)
INSERT INTO "line_items" ("quantity", "instrument_id", "updated_at", "created_at", "cart_id") VALUES(1, 1, '2021-08-06 09:39:24', '2021-08-06 09:39:24', 22)
---
  def create
    instrument = Instrument.find(params[:instrument_id])
    @line_item = @cart.add_instrument(instrument)
    #@line_item = LineItem.new(params[:line_item])

    respond_to do |format|
      if @line_item.save

SELECT * FROM "line_items" WHERE ("line_items"."id" = 3)
SELECT * FROM "carts" WHERE ("carts"."id" = 2)
DELETE FROM "line_items" WHERE "id" = 4
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @cart = Cart.find(session[:cart_id])
    @line_item.destroy